TSURKOVSERGEY/sdi/stm/stm32L151project/system/system_stm32l1xx_old.c
    /* Wait till PLL is ready */
    while((RCC->CR & RCC_CR_PLLRDY) == 0)
    {
    }
        
    /* Select PLL as system clock source */
    RCC->CFGR &= (uint32_t)((uint32_t)~(RCC_CFGR_SW));
    RCC->CFGR |= (uint32_t)RCC_CFGR_SW_PLL;    

    /* Wait till PLL is used as system clock source */
    while ((RCC->CFGR & (uint32_t)RCC_CFGR_SWS) != (uint32_t)0x0C)
    {
    }
  }
  else
  { 
    /* If HSE fails to start-up, the application will have wrong clock 
       configuration. User can add here some code to deal with this error */    
  } 
}

#else
/**
  * @brief  Selects MSI as System clock source and configure HCLK, PCLK2
  *         and PCLK1 prescalers.
  * @note   This function should be used only after reset.
  * @param  None
  * @retval None
  */
static void SetSysClockToMSI(void)
{
  __IO uint32_t StartUpCounter = 0, MSIStatus = 0;
  
  /* SYSCLK, HCLK, PCLK2 and PCLK1 configuration ---------------------------*/    
  /* Enable MSI */    
  RCC->CR |= ((uint32_t)RCC_CR_MSION);
 
  /* Wait till MSI is ready and if Time out is reached exit */
  do
  {
    MSIStatus = RCC->CR & RCC_CR_MSIRDY;
    StartUpCounter++;  
  } while((MSIStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

  if ((RCC->CR & RCC_CR_MSIRDY) != RESET)
  {
    MSIStatus = (uint32_t)0x01;
  }
  else
  {
    MSIStatus = (uint32_t)0x00;
  }  
  
  if (MSIStatus == (uint32_t)0x01)
  { 
#ifdef SYSCLK_FREQ_MSI
#ifdef SYSCLK_FREQ_MSI_4MHz
    /* Enable 64-bit access */
    FLASH->ACR |= FLASH_ACR_ACC64;
    
    /* Enable Prefetch Buffer */
    FLASH->ACR |= FLASH_ACR_PRFTEN;    

    /* Flash 1 wait state */
    FLASH->ACR |= FLASH_ACR_LATENCY; 
#else
    /* Flash 0 wait state */
    FLASH->ACR &= ~FLASH_ACR_LATENCY;
    
    /* Disable Prefetch Buffer */
    FLASH->ACR &= ~FLASH_ACR_PRFTEN;    

    /* Disable 64-bit access */
    FLASH->ACR &= ~FLASH_ACR_ACC64;
#endif
#endif
    /* Enable the PWR APB1 Clock */
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;
  
    /* Select the Voltage Range 3 (1.2V) */
    PWR->CR = PWR_CR_VOS;
  
    /* Wait Until the Voltage Regulator is ready */
    while((PWR->CSR & PWR_CSR_VOSF) != RESET)
    {
    }
    
    /* HCLK = SYSCLK */
    RCC->CFGR |= (uint32_t)RCC_CFGR_HPRE_DIV1;
      
    /* PCLK2 = HCLK */
    RCC->CFGR |= (uint32_t)RCC_CFGR_PPRE2_DIV1;
    
    /* PCLK1 = HCLK */
    RCC->CFGR |= (uint32_t)RCC_CFGR_PPRE1_DIV1;

#ifdef SYSCLK_FREQ_MSI
  #ifdef SYSCLK_FREQ_MSI_64KHz
    /* Set MSI clock range */
    RCC->ICSCR &= (uint32_t)((uint32_t)~(RCC_ICSCR_MSIRANGE));
    RCC->ICSCR |= (uint32_t)RCC_ICSCR_MSIRANGE_64KHz;   
  #elif defined SYSCLK_FREQ_MSI_128KHz
    /* Set MSI clock range */
    RCC->ICSCR &= (uint32_t)((uint32_t)~(RCC_ICSCR_MSIRANGE));
    RCC->ICSCR |= (uint32_t)RCC_ICSCR_MSIRANGE_128KHz; 
  #elif defined SYSCLK_FREQ_MSI_256KHz
    /* Set MSI clock range */
    RCC->ICSCR &= (uint32_t)((uint32_t)~(RCC_ICSCR_MSIRANGE));    
    RCC->ICSCR |= (uint32_t)RCC_ICSCR_MSIRANGE_256KHz;
  #elif defined SYSCLK_FREQ_MSI_512KHz
    /* Set MSI clock range */
    RCC->ICSCR &= (uint32_t)((uint32_t)~(RCC_ICSCR_MSIRANGE));
    RCC->ICSCR |= (uint32_t)RCC_ICSCR_MSIRANGE_512KHz;
  #elif defined SYSCLK_FREQ_MSI_1MHz
    /* Set MSI clock range */
    RCC->ICSCR &= (uint32_t)((uint32_t)~(RCC_ICSCR_MSIRANGE));
    RCC->ICSCR |= (uint32_t)RCC_ICSCR_MSIRANGE_1MHz;
  #elif defined SYSCLK_FREQ_MSI_2MHz
    /* Set MSI clock range */
    RCC->ICSCR &= (uint32_t)((uint32_t)~(RCC_ICSCR_MSIRANGE));    
    RCC->ICSCR |= (uint32_t)RCC_ICSCR_MSIRANGE_2MHz;
  #elif defined SYSCLK_FREQ_MSI_4MHz     
    /* Set MSI clock range */
    RCC->ICSCR &= (uint32_t)((uint32_t)~(RCC_ICSCR_MSIRANGE));    
    RCC->ICSCR |= (uint32_t)RCC_ICSCR_MSIRANGE_4MHz;                                
  #endif
#endif    
    
    /* Select MSI as system clock source */
    RCC->CFGR &= (uint32_t)((uint32_t)~(RCC_CFGR_SW));
    RCC->CFGR |= (uint32_t)RCC_CFGR_SW_MSI;    

    /* Wait till MSI is used as system clock source */
    while ((RCC->CFGR & (uint32_t)RCC_CFGR_SWS) != (uint32_t)0x00)
    {
    }
  }
  else
  { 
    /* If MSI fails to start-up, the application will have wrong clock 
       configuration. User can add here some code to deal with this error */    
  }
}
#endif

/**
  * @}
  */

/**
  * @}
  */
  
/**
  * @}
  */
    
/******************* (C) COPYRIGHT 2010 STMicroelectronics *****END OF FILE****/
